Repository: wangchong2023/KnowledgeBase
Catalog: KnowledgeBase/Localization/Localizable.xcstrings
Source language: zh_hans
Languages: en

# a11y.highContrast
source: 高对比度
en: High Contrast

# a11y.links
source: 个链接
en: links

# a11y.reduceMotion
source: 减弱动态效果
en: Reduce Motion

# a11y.tags
source: 标签
en: Tags

# a11y.tapToOpen
source: 轻点打开
en: Tap to open

# a11y.words
source: 字
en: words

# action.browseGraph
source: 浏览图谱
en: Browse Graph

# action.browseGraph.subtitle
source: 可视化知识关联
en: Visualize knowledge connections

# action.createPage
source: 创建页面
en: Create Page

# action.createPage.subtitle
source: 新建一个 Wiki 页面
en: Create a new Wiki page

# action.healthCheck
source: 健康检查
en: Health Check

# action.healthCheck.subtitle
source: 检测断链、孤立页面、矛盾
en: Detect broken links, orphan pages, conflicts

# action.ingestKnowledge
source: 导入知识
en: Ingest Knowledge

# action.ingestKnowledge.subtitle
source: 将原始资料编译到 Wiki
en: Compile raw material into Wiki

# backlinks.backlinks
source: 反向链接
en: Backlinks

# backlinks.backlinksCount
source: 反向链接 (%d)
en: Backlinks (%d)

# backlinks.close
source: 关闭
en: Close

# backlinks.noBacklinks
source: 无反向链接
en: No backlinks

# backlinks.noBackLinks
source: 无反向链接
en: No backlinks

# backlinks.noOutgoing
source: 无出链
en: No outgoing links

# backlinks.noOutLinks
source: 无出链
en: No out-links

# backlinks.outgoing
source: 出链
en: Outgoing Links

# backlinks.outgoingCount
source: 出链 (%d)
en: Outgoing (%d)

# backlinks.title
source: 反向链接
en: Backlinks

# backup.actions
source: 操作
en: Actions

# backup.autoBackup
source: 自动备份
en: Auto Backup

# backup.createNow
source: 立即创建备份
en: Create Backup Now

# backup.exportCurrent
source: 导出当前数据
en: Export Current Data

# backup.history
source: 备份历史
en: Backup History

# backup.lastBackup
source: 上次备份
en: Last Backup

# backup.log.crashRecovery
source: 检测到崩溃恢复 - 发现脏标记
en: Crash recovery detected — dirty flag found

# backup.log.createFailed
source: 备份失败: %@
en: Backup failed: %@

# backup.log.restoreFailed
source: 恢复备份失败: %@
en: Restore backup failed: %@

# backup.log.saveIndexFailed
source: 保存备份索引失败: %@
en: Save backup index failed: %@

# backup.noBackups
source: 暂无备份
en: No Backups

# backup.noBackupsDesc
source: 创建备份以保护您的知识库数据
en: Create a backup to protect your wiki data

# backup.pages
source: 页
en: pages

# backup.restore
source: 恢复
en: Restore

# backup.restoreMessage
source: 确定要从此备份恢复吗？当前数据将被替换，恢复前会自动创建安全备份。
en: Are you sure you want to restore from this backup? Current data will be replaced. A safety backup will be created first.

# backup.restoreTitle
source: 恢复备份
en: Restore Backup

# backup.settings
source: 备份设置
en: Backup Settings

# backup.title
source: 备份与恢复
en: Backup & Recovery

# backup.words
source: 字
en: words

# chat.clearHistory
source: 清空对话
en: Clear Chat

# chat.collapse
source: 收起
en: Collapse

# chat.configureFirst
source: 请先配置 LLM API Key
en: Please configure LLM API Key first

# chat.error
source: 错误
en: Error

# chat.expandFull
source: 展开全文
en: Expand full text

# chat.expanding
source: 展开全文
en: Expand full text

# chat.inputPlaceholder
source: 问你的知识库...
en: Ask your wiki...

# chat.llmSettings
source: LLM 设置
en: LLM Settings

# chat.notConfigured
source: 请先配置 LLM API Key
en: Please configure LLM API Key first

# chat.ok
source: 确定
en: OK

# chat.sending
source: 发送中...
en: Sending...

# chat.suggested.compare
source: 对比不同概念的异同
en: Compare similarities and differences between concepts

# chat.suggested.connections
source: 有哪些页面之间可能存在关联但没有链接？
en: Which pages might be related but not linked?

# chat.suggested.explain
source: 解释这些概念之间的关系
en: Explain the relationships between these concepts

# chat.suggested.gaps
source: 知识库中有哪些盲区需要补充？
en: What gaps exist in my wiki that need filling?

# chat.suggested.organize
source: 帮我整理知识结构
en: Help me organize the knowledge structure

# chat.suggested.recommend
source: 推荐可以添加的新页面
en: Recommend new pages to add

# chat.suggested.summarize
source: 总结我的知识库中最重要的概念
en: Summarize the most important concepts in my wiki

# chat.suggested.whatContent
source: 知识库中有哪些内容？
en: What content is in my wiki?

# chat.title
source: AI 助手
en: AI Assistant

# chat.welcomeDesc
source: 基于你的知识库内容回答问题，发现关联，发现盲区
en: Answer questions based on your wiki, discover connections, find gaps

# chat.welcomeTitle
source: 知识库 AI 助手
en: Knowledge Base AI Assistant

# collab.connectedUsers
source: 已连接的用户
en: Connected Users

# collab.defaultRoom
source: 知识库协作房间
en: Knowledge Base Room

# collab.hostedBy
source: 主持人:
en: Hosted by

# collab.hostSession
source: 主持协作
en: Host Session

# collab.hostSetup
source: 设置协作房间
en: Set Up Collaboration Room

# collab.howItWorks
source: 工作原理
en: How It Works

# collab.info.encrypted
source: 端到端加密传输
en: End-to-end encrypted

# collab.info.local
source: 通过本地 Wi-Fi / 蓝牙直连
en: Connect via local Wi-Fi / Bluetooth

# collab.info.maxPeers
source: 最多支持 8 位协作者
en: Supports up to 8 collaborators

# collab.joining
source: 正在加入房间...
en: Joining room...

# collab.joinSession
source: 加入协作
en: Join Session

# collab.leaveSession
source: 离开协作
en: Leave Session

# collab.nearbyRooms
source: 附近的协作房间
en: Nearby Rooms

# collab.noEdits
source: 暂无编辑记录
en: No edits yet

# collab.recentEdits
source: 最近的编辑
en: Recent Edits

# collab.role.editor
source: 编辑者
en: Editor

# collab.role.owner
source: 主持人
en: Owner

# collab.role.viewer
source: 查看者
en: Viewer

# collab.room
source: 知识库 Room
en: Knowledge Base Room

# collab.roomName
source: 房间名称
en: Room Name

# collab.roomNamePlaceholder
source: 输入房间名称
en: Enter room name

# collab.searching
source: 正在搜索...
en: Searching...

# collab.simulatorWarning
source: MultipeerConnectivity 在模拟器上不可用，请在真机上测试协作功能。
en: MultipeerConnectivity is unavailable on the Simulator. Please test collaboration on a real device.

# collab.startHosting
source: 开始主持
en: Start Hosting

# collab.status.advertiseError
source: 广播失败
en: Advertising failed

# collab.status.browseError
source: 搜索失败
en: Browsing failed

# collab.status.connected
source: 已连接
en: Connected

# collab.status.connecting
source: 连接中...
en: Connecting...

# collab.status.disconnected
source: 已断开
en: Disconnected

# collab.status.hosting
source: 正在主持协作
en: Hosting collaboration

# collab.status.joining
source: 正在加入...
en: Joining...

# collab.status.pageReceived
source: 收到页面同步
en: Page sync received

# collab.status.ready
source: 就绪
en: Ready

# collab.status.searching
source: 正在搜索附近的协作房间...
en: Searching for nearby rooms...

# collab.status.simulatorNotSupported
source: 模拟器不支持本地协作
en: Simulator does not support local collaboration

# collab.stopSearching
source: 停止搜索
en: Stop Searching

# collab.subtitle
source: 通过本地网络与他人实时协作编辑知识库
en: Real-time collaboration with others over local network

# collab.title
source: 实时协作
en: Collaboration

# collab.username
source: 用户名
en: Username

# collab.usernamePlaceholder
source: 输入你的名字
en: Enter your name

# confidence.high
source: 高
en: High

# confidence.low
source: 低
en: Low

# confidence.medium
source: 中
en: Medium

# create.basicInfo
source: 基本信息
en: Basic Info

# create.cancel
source: 取消
en: Cancel

# create.comparisonDimensions
source: 对比维度
en: Comparison Dimensions

# create.comparisonTemplate
source: 对比模板
en: Comparison Template

# create.conceptTemplate
source: 概念模板
en: Concept Template

# create.conclusion
source: 结论
en: Conclusion

# create.content
source: 内容
en: Content

# create.contentPlaceholder
source: 输入内容...
en: Enter content...

# create.coreContributions
source: 核心贡献
en: Core Contributions

# create.corePoints
source: 核心要点
en: Core Points

# create.create
source: 创建
en: Create

# create.creating
source: 创建中...
en: Creating...

# create.definition
source: 定义
en: Definition

# create.description
source: 说明
en: Description

# create.dimension
source: 维度
en: Dimension

# create.entityTemplate
source: 实体模板
en: Entity Template

# create.keyIdeas
source: 关键理念
en: Key Ideas

# create.overview
source: 概述
en: Overview

# create.pageTitle
source: 页面标题
en: Page title

# create.quickTemplates
source: 快速模板
en: Quick Templates

# create.relatedLinks
source: 相关链接
en: Related Links

# create.selectIcon
source: 选择图标
en: Select icon

# create.selectType
source: 选择类型
en: Select type

# create.selectTypeHint
source: 为新页面选择一个合适的类型
en: Choose a suitable type for the new page

# create.tagsPlaceholder
source: 标签（逗号分隔）
en: Tags (comma separated)

# create.title
source: 创建页面
en: Create Page

# deepLink.log.indexingFailed
source: Spotlight 索引失败: %@
en: Spotlight indexing failed: %@

# deeplink.openedPage
source: 已打开页面
en: Opened page

# deeplink.pageNotFound
source: 未找到页面
en: Page not found

# detail.backlinks
source: 反向链接
en: Backlinks

# detail.cancel
source: 取消
en: Cancel

# detail.confidence
source: 可信度
en: Confidence

# detail.confirmDelete
source: 确认删除
en: Confirm Delete

# detail.created
source: 创建
en: Created

# detail.deleteMessage
source: 此操作不可恢复，页面及所有引用将被删除。
en: This action cannot be undone. The page and all references will be deleted.

# detail.deletePage
source: 删除页面
en: Delete Page

# detail.noBacklinks
source: 暂无反向链接
en: No backlinks yet

# detail.outLinks
source: 出链
en: out-links

# detail.pageType
source: 页面类型
en: Page Type

# detail.status
source: 状态
en: Status

# detail.updated
source: 更新
en: Updated

# detail.words
source: 字
en: words

# editor.addAlias
source: 添加别名
en: Add Alias

# editor.addTag
source: 添加标签
en: Add Tag

# editor.aliasPlaceholder
source: 输入别名
en: Enter alias

# editor.bidirectionalLinks
source: 支持 [[双向链接]] 语法
en: Supports [[bidirectional links]] syntax

# editor.bold
source: 粗体
en: Bold

# editor.cancel
source: 取消
en: Cancel

# editor.code
source: 代码
en: Code

# editor.divider
source: 分割线
en: Divider

# editor.enterAlias
source: 输入别名
en: Enter alias

# editor.enterTag
source: 输入标签
en: Enter tag

# editor.iconCustomized
source: 已自定义
en: Customized

# editor.insertWikiLink
source: 插入 Wiki 链接
en: Insert Wiki Link

# editor.italic
source: 斜体
en: Italic

# editor.link
source: 链接
en: Link

# editor.list
source: 列表
en: List

# editor.pageTitle
source: 页面标题
en: Page Title

# editor.pageTitlePlaceholder
source: 输入页面标题
en: Enter page title

# editor.quote
source: 引用
en: Quote

# editor.searchPage
source: 搜索页面...
en: Search pages...

# editor.searchPages
source: 搜索页面...
en: Search pages...

# editor.selectedText
source: 选中文本
en: Selected text

# editor.table
source: 表格
en: Table

# editor.tableColumn1
source: 列1
en: Column 1

# editor.tableColumn2
source: 列2
en: Column 2

# editor.tableColumn3
source: 列3
en: Column 3

# editor.tableContent
source: 内容
en: Content

# editor.tagPlaceholder
source: 输入标签
en: Enter tag

# editor.wikiLink
source: Wiki链接
en: WikiLink

# empty.actionHint
source: 可执行操作
en: Action available

# empty.hint
source: 提示
en: Hint

# export.aliases
source: 别名
en: Aliases

# export.confidence
source: 可信度
en: Confidence

# export.created
source: 创建
en: Created

# export.exportTime
source: 导出时间
en: Export Time

# export.header
source: 知识库导出
en: Knowledge Base Export

# export.imported
source: 导入
en: Imported

# export.importedPage
source: 导入页面
en: Imported Page

# export.status
source: 状态
en: Status

# export.tags
source: 标签
en: Tags

# export.totalPages
source: 总页面
en: Total Pages

# export.type
source: 类型
en: Type

# export.updated
source: 更新
en: Updated

# graph.all
source: 全部
en: All

# graph.connections
source: 连接
en: connections

# graph.emptyDesc
source: 页面间的关联将在此可视化
en: Page connections will be visualized here

# graph.linkHint
source: 在编辑页面时使用 [[页面名]] 即可建立链接
en: Use [[Page Name]] in the editor to create links

# graph.nodes
source: 节点
en: nodes

# graph.nodesConnections
source: %d 节点 · %d 连接
en: %d nodes · %d connections

# graph.title
source: 知识图谱
en: Knowledge Graph

# graph3d.title
source: 3D 图谱
en: 3D Graph

# graph3d.viewPage
source: 查看页面
en: View Page

# icloud.aboutSync
source: 关于 iCloud 同步
en: About iCloud Sync

# icloud.autoSync
source: 自动同步
en: Auto Sync

# icloud.autoSyncFailed
source: 自动同步失败
en: Auto sync failed

# icloud.bidirectional
source: 双向同步
en: Two-way sync

# icloud.bidirectionalSync
source: 双向同步
en: Bidirectional Sync

# icloud.clearCloudData
source: 清除 iCloud 数据
en: Clear iCloud Data

# icloud.cloudKitError
source: CloudKit 错误
en: CloudKit error

# icloud.conflictDetected
source: 冲突检测
en: Conflict Detected

# icloud.conflictFailed
source: 冲突解决失败
en: Conflict resolution failed

# icloud.conflictMessage
source: 本地与远程数据存在冲突，请选择解决方式。
en: Local and remote data have conflicts. Please choose a resolution.

# icloud.conflictPolicy
source: 冲突解决策略
en: Conflict Resolution Policy

# icloud.decodingFailed
source: 数据解码失败
en: Data decoding failed

# icloud.disableSync
source: 停用 iCloud 同步
en: Disable iCloud Sync

# icloud.download
source: 从 iCloud 下载
en: Download from iCloud

# icloud.enableSync
source: 启用 iCloud 同步
en: Enable iCloud Sync

# icloud.encodingFailed
source: 数据编码失败
en: Data encoding failed

# icloud.error.cloudKit
source: CloudKit 错误
en: CloudKit Error

# icloud.error.conflictResolution
source: 冲突解决失败
en: Conflict resolution failed

# icloud.error.decoding
source: 数据解码失败
en: Data decoding failed

# icloud.error.encoding
source: 数据编码失败
en: Data encoding failed

# icloud.error.notAvailable
source: iCloud 不可用，请确认已登录 iCloud 账户
en: iCloud unavailable. Please sign in to your iCloud account.

# icloud.idle
source: 未同步
en: Not synced

# icloud.info1
source: 数据通过 iCloud 私有数据库存储
en: Data is stored via iCloud private database

# icloud.info2
source: 仅限同一 Apple ID 的设备间同步
en: Sync only between devices with the same Apple ID

# icloud.info3
source: 冲突时默认合并两边数据
en: Defaults to merging data from both sides on conflict

# icloud.info4
source: 页面以更新时间为准，保留较新版本
en: Pages use update time, keeping the newer version

# icloud.keepLocal
source: 保留本地
en: Keep Local

# icloud.keepRemote
source: 保留远程
en: Keep Remote

# icloud.lastSync
source: 上次同步
en: Last synced

# icloud.lastSyncFormat
source: 上次同步：%@
en: Last sync: %@

# icloud.merge
source: 合并（推荐）
en: Merge (Recommended)

# icloud.neverSynced
source: 从未同步
en: Never synced

# icloud.notAvailable
source: iCloud 不可用，请确认已登录 iCloud 账户
en: iCloud unavailable. Please sign in to your iCloud account.

# icloud.notConfigured
source: 未配置
en: Not configured

# icloud.pullFromCloud
source: 从 iCloud 下载
en: Download from iCloud

# icloud.pullOverwriteMessage
source: 所有本地页面将被远程数据替换，此操作不可撤销。
en: All local pages will be replaced by remote data, this action cannot be undone.

# icloud.pullWillOverwrite
source: 从 iCloud 下载将覆盖本地数据
en: Downloading from iCloud will overwrite local data

# icloud.pushToCloud
source: 上传到 iCloud
en: Upload to iCloud

# icloud.status
source: iCloud 同步状态
en: iCloud Sync Status

# icloud.syncActions
source: 同步操作
en: Sync Actions

# icloud.synced
source: 已同步
en: Synced

# icloud.syncError
source: 同步错误
en: Sync Error

# icloud.syncFailed
source: 同步失败
en: Sync failed

# icloud.syncing
source: 同步中...
en: Syncing...

# icloud.syncNow
source: 立即同步
en: Sync now

# icloud.syncSettings
source: 同步设置
en: Sync Settings

# icloud.syncStatus
source: iCloud 同步状态
en: iCloud Sync Status

# icloud.title
source: iCloud 同步
en: iCloud Sync

# icloud.upload
source: 上传到 iCloud
en: Upload to iCloud

# iconPicker.academic
source: 学术
en: Academic

# iconPicker.allIcons
source: 全部图标
en: All Icons

# iconPicker.common
source: 常用
en: Common

# iconPicker.customSelected
source: 已选择自定义图标
en: Custom icon selected

# iconPicker.nature
source: 自然
en: Nature

# iconPicker.reset
source: 重置
en: Reset

# iconPicker.selectIcon
source: 选择图标
en: Select Icon

# iconPicker.symbols
source: 符号
en: Symbols

# iconPicker.transport
source: 交通
en: Transport

# iconPicker.useDefault
source: 使用默认图标
en: Use default icon

# index.comparisonCount
source: 对比 (%d)
en: Comparisons (%d)

# index.comparisons
source: 对比
en: Comparisons

# index.conceptCount
source: 概念 (%d)
en: Concepts (%d)

# index.concepts
source: 概念
en: Concepts

# index.entities
source: 实体
en: Entities

# index.entityCount
source: 实体 (%d)
en: Entities (%d)

# index.lastUpdated
source: 最后更新
en: Last Updated

# index.maps
source: 地图
en: Maps

# index.overview
source: 概览
en: Overview

# index.pages
source: 页面
en: Pages

# index.raw
source: 原始
en: Raw

# index.sourceCount
source: 来源 (%d)
en: Sources (%d)

# index.sources
source: 来源
en: Sources

# index.total
source: 总计
en: Total

# index.viewAll
source: 查看全部
en: View all

# index.wordCount
source: %d 字
en: %d words

# index.words
source: 字
en: words

# ingest.compileRules
source: 编译规则：提取关键信息、建立 [[双向链接]]、推荐标签
en: Compilation rules: extract key info, establish [[bidirectional links]], recommend tags

# ingest.compiling
source: 编译中...
en: Compiling...

# ingest.confirmIngest
source: 确认导入
en: Confirm Import

# ingest.contentLabel
source: 内容
en: Content

# ingest.discard
source: 放弃
en: Discard

# ingest.error
source: 错误
en: Error

# ingest.field.content
source: 内容
en: Content

# ingest.field.icon
source: 图标
en: Icon

# ingest.field.tags
source: 标签
en: Tags (comma-separated)

# ingest.field.tagsPlaceholder
source: 标签，用逗号分隔
en: AI, Knowledge Management, LLM

# ingest.field.title
source: 标题
en: Title

# ingest.field.titlePlaceholder
source: 输入页面标题
en: Enter page title

# ingest.field.type
source: 类型
en: Type

# ingest.flow
source: 导入流程
en: Ingest Flow

# ingest.hero.subtitle
source: 将原始资料编译到 Wiki，自动提取关键信息并建立交叉引用
en: Compile raw materials into your knowledge base, auto-extract key information and create cross-references

# ingest.hero.title
source: 知识导入
en: Knowledge Import

# ingest.iconCustom
source: 自定义
en: Customized

# ingest.iconDefault
source: 默认
en: Default

# ingest.iconReset
source: 重置
en: Reset

# ingest.llmPreview
source: LLM 编译预览
en: LLM Compile Preview

# ingest.manualEntry
source: 手动输入
en: Manual Entry

# ingest.manualEntryHint
source: 粘贴或输入内容
en: Paste or type content

# ingest.manualTitle
source: 手动输入
en: Manual Entry

# ingest.ocrScan
source: OCR 扫描
en: OCR Scan

# ingest.ocrScanHint
source: 从图片中识别文字
en: Recognize text from images

# ingest.ok
source: 确定
en: OK

# ingest.preview
source: 预览
en: LLM Compilation Preview

# ingest.previewConfirm
source: 确认导入
en: Confirm Import

# ingest.previewDiscard
source: 放弃
en: Discard

# ingest.smartIngest
source: 智能导入 (LLM)
en: Smart Ingest (LLM)

# ingest.smartIngest.description
source: LLM 将自动编译原始资料：提取关键信息、建立交叉引用、推荐标签和类型
en: LLM will auto-compile raw material: extract key info, build cross-references, suggest tags and type

# ingest.smartIngestDone
source: 智能导入
en: Smart Import

# ingest.smartIngestDoneDesc
source: LLM 编译完成，类型: %@
en: LLM compilation complete, type: %@

# ingest.smartToggle
source: 智能导入
en: Smart Import (LLM)

# ingest.smartToggleHint
source: 使用 AI 提取关键信息并建立链接
en: LLM will auto-compile raw materials: extract key info, create cross-references, recommend tags and types

# ingest.step1
source: 将原始资料粘贴到内容区域
en: Paste raw material into content area

# ingest.step2
source: 选择页面类型和标签
en: Select page type and tags

# ingest.step3
source: 点击导入，系统自动编译
en: Click import, system auto-compiles

# ingest.step4
source: 自动检测已有页面的交叉引用
en: Auto-detect cross-references with existing pages

# ingest.step5
source: 更新索引和操作日志
en: Update index and operation log

# ingest.submit
source: 导入
en: Import to Wiki

# ingest.submitting
source: 导入中...
en: Compiling...

# ingest.success
source: 导入成功！知识已编译到 Wiki
en: Ingest successful! Knowledge compiled to Wiki

# ingest.suggestedRelations
source: 建议关联
en: Suggested Relations

# ingest.suggestLinks
source: 建议链接
en: Suggested Links

# ingest.tagsLabel
source: 标签（逗号分隔）
en: Tags (comma separated)

# ingest.tagsPlaceholder
source: AI, 知识管理, LLM
en: AI, knowledge, LLM

# ingest.tip1
source: 将原始资料粘贴到内容区域
en: Paste raw materials into the content area

# ingest.tip2
source: 选择页面类型和标签
en: Select page type, icon and tags

# ingest.tip3
source: 点击导入，系统自动编译
en: Click Import, system will auto-compile

# ingest.tip4
source: 自动检测已有页面的交叉引用
en: Auto-detect cross-references with existing pages

# ingest.tip5
source: 更新索引和操作日志
en: Update index and operation log

# ingest.tips
source: 使用提示
en: Import Process

# ingest.title
source: 知识导入
en: Knowledge Ingest

# ingest.titleLabel
source: 标题
en: Title

# ingest.titlePlaceholder
source: 输入页面标题
en: Enter page title

# ingest.typeLabel
source: 类型
en: Type

# lint.brokenLink
source: 断链: 「%@」引用了不存在的页面 [[%@]]
en: Broken link: \

# lint.brokenLinkSuggestion
source: 创建页面「%@」或修复链接
en: Create page \

# lint.checking
source: 检查中...
en: Checking...

# lint.errors
source: 错误
en: Errors

# lint.foundIssues
source: 发现 %d 个问题
en: Found %d issues

# lint.goToPage
source: 前往页面 →
en: Go to page →

# lint.healthy
source: 知识库状态良好
en: Wiki is healthy

# lint.healthyDesc
source: 没有发现断链、孤立页面或矛盾内容
en: No broken links, orphan pages, or conflicts found

# lint.noIssues
source: 知识库状态良好
en: Knowledge base is in good health

# lint.noIssuesHint
source: 没有发现断链、孤立页面或矛盾内容
en: No broken links, orphaned pages or conflicting content found

# lint.ok
source: 正常
en: OK

# lint.orphanPage
source: 孤立页面: 「%@」没有任何反向链接
en: Orphan page: \

# lint.orphanSuggestion
source: 考虑从相关页面添加 [[%@]] 链接
en: Consider adding [[%@]] links from related pages

# lint.outdated
source: 可能过时: 「%@」已超过30天未更新
en: Possibly outdated: \

# lint.outdatedSuggestion
source: 检查内容是否需要更新
en: Check if content needs updating

# lint.runCheck
source: 运行健康检查
en: Run Health Check

# lint.running
source: 检查中...
en: Checking...

# lint.stubContent
source: 占位内容: 「%@」内容少于100字
en: Stub content: \

# lint.stubSuggestion
source: 补充更多内容或将状态改为「占位」
en: Add more content or change status to \

# lint.tips
source: 提示
en: Tips

# lint.title
source: 健康检查
en: Health Check

# lint.warnings
source: 警告
en: Warnings

# llm.apiAddress
source: API 地址
en: API URL

# llm.apiKeyPlaceholder
source: 输入 API Key
en: Enter API Key

# llm.chatHistory
source: 对话记录
en: Chat History

# llm.chatSection
source: 对话
en: Chat

# llm.clearHistory
source: 清空对话记录
en: Clear Chat History

# llm.configuration
source: 配置
en: Configuration

# llm.configured
source: 已配置
en: Configured

# llm.connectionSuccess
source: 连接成功！API Key 有效
en: Connection successful! API Key is valid

# llm.customAPI
source: 自定义 API
en: Custom API

# llm.enable
source: 启用 LLM 助手
en: Enable LLM Assistant

# llm.enableAssistant
source: 启用 LLM 助手
en: Enable LLM Assistant

# llm.enabled
source: 已启用
en: Enabled

# llm.error.apiError
source: API 错误
en: API Error

# llm.error.cancelled
source: 请求已取消
en: Request cancelled

# llm.error.httpError
source: HTTP 错误
en: HTTP Error

# llm.error.invalidResponse
source: API 返回格式异常
en: Invalid API response format

# llm.error.invalidURL
source: API 地址无效
en: Invalid API URL

# llm.error.notConfigured
source: LLM 未配置。请在设置中填写 API Key。
en: LLM not configured. Please enter API Key in Settings.

# llm.error.rateLimited
source: 请求过于频繁，请稍后重试
en: Too many requests, please try again later

# llm.error.unauthorized
source: API Key 无效或已过期
en: API Key invalid or expired

# llm.info
source: 说明
en: Info

# llm.info.contextSent
source: 对话时会发送知识库内容作为上下文
en: Wiki content is sent as context during conversations

# llm.info.localKey
source: API Key 仅存储在本地设备
en: API Key is stored locally on device only

# llm.info.openAICompatible
source: 支持所有 OpenAI 兼容 API
en: Supports all OpenAI-compatible APIs

# llm.info.smartIngest
source: 智能导入使用 LLM 编译原始资料
en: Smart import uses LLM to compile raw material

# llm.ingest.compileInstruction
source: 请将以下原始资料编译为结构化的 Wiki 页面内容。
en: Please compile the following raw material into a structured Wiki page.

# llm.ingest.compileRules
source: 编译规则：
en: Compilation rules:

# llm.ingest.existingPages
source: 已有 Wiki 页面（请优先链接这些）
en: Existing Wiki pages (link these preferentially)

# llm.ingest.jsonCompiledContent
source: 编译后的 Markdown 内容
en: Compiled Markdown content

# llm.ingest.jsonFormat
source: 请以 JSON 格式返回编译结果：
en: Return the compiled result in JSON format:

# llm.ingest.jsonSuggestedTags
source: 标签
en: tags

# llm.ingest.jsonSummary
source: 一段简短摘要
en: A brief summary

# llm.ingest.rawContent
source: 原始资料内容：
en: Raw material content:

# llm.ingest.rawTitle
source: 原始资料标题
en: Raw material title

# llm.ingest.rule1
source: 1. 使用 Markdown 格式
en: 1. Use Markdown format
